app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `pelanggan`
SELECT COUNT(*) AS `numrows` FROM `produk`
SELECT COUNT(*) AS `numrows` FROM `transaksi`
---
    public function index()
    {
        $data = [
            'title' => "Admin Dashboard | SIAPSIR - Sistem Aplikasi Kasir",
            'header' => "Dashboard",
        ];

        $data['pelanggancount'] = $this->pelanggan->countAll();
        $data['produkcount'] = $this->produk->countAll();
        $data['transaksicount'] = $this->transaksi->countAll();