app/Controllers/Admin/Transaksi.php

SELECT COUNT(*) AS `numrows` FROM `transaksi`
---
    public function index()
    {
        $data = [
            'title' => "Data Transaksi | SIAPSIR - Sistem Aplikasi Kasir ",
            'header' => "Data Transaksi",
            'cardtitle' => "Tabel Transaksi",
            'inputtitle' => "Form Input Data Transaksi",
            'updatetitle' => "Form Update Data Transaksi",
            'deletetitle' => "Delete Data Transaksi",
        ];

        $data['pelanggan'] = $this->pelanggan->getPelanggan()->getResult();
        $data['produk'] = $this->produk->getProduk()->getResult();

        $data['transaksi'] = $this->transaksi->getTransaksiByAllId()->getResult();
        $data['transaksicount'] = $this->transaksi->countAll();