app/Controllers/Petugas/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `transaksi`
---
    public function index()
    {
        $data = [
            'title' => "Petugas Dashboard | SIAPSIR - Sistem Aplikasi Kasir",
            'header' => "Dashboard",
        ];

        $data['transaksicount'] = $this->transaksi->countAll();