app/Controllers/Petugas/Laporan.php

SELECT COUNT(*) AS `numrows` FROM `transaksi`
---
    public function index()
    {
        $data = [
            'title' => "Data Laporan | SIAPSIR - Sistem Aplikasi Kasir",
            'header' => "Data Laporan",
            'cardtitle' => "Tabel Rincian Laporan",
        ];

        $data['transaksi']  = $this->transaksi->getTransaksiByAllId()->getResult();

        $data['transaksicount'] = $this->transaksi->countAll();