app/Controllers/Auth.php

    public function login(){
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $where = array(
            'username' => $username,
            'password' => $password
        );

        $auth = $this->user->cek_login("admin", $where);
        $logged_in_adm = $auth->getFirstRow();

        if ($logged_in_adm != null) {
            $username = $this->request->getVar('username');
            $user = $this->user->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'petugas'
 LIMIT 1