app/Models/ProdukModel.php

    public function getProduk(){
        $builder = $this->db->table('produk');
        return $builder->get();
---
SELECT *
FROM `produk`