app/Models/TransaksiModel.php

SELECT *
FROM `transaksi`
LEFT JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `transaksi`.`id_pelanggan`
LEFT JOIN `produk` ON `produk`.`id_produk` = `transaksi`.`id_produk`
---
    public function getTransaksiByAllId(){
        $builder = $this->db->table('transaksi');
        $builder->select('*');
        $builder->join('user', 'user.id_user = transaksi.id_user', 'left');
        $builder->join('pelanggan', 'pelanggan.id_pelanggan = transaksi.id_pelanggan', 'left');
        $builder->join('produk', 'produk.id_produk = transaksi.id_produk', 'left');
        return $builder->get();